# Dataset description
Here a list of all the used datasets with a description follows 
- [Aim1](../code/Aim1.ipynb)
    - [preL_dt](#preL_dt)
    
    
- [Air_poll_assignment](../code/Air_poll_assignment.ipynb)
    - [merged_covid_dt](#merged_covid_dt)
    - [pm25_df, no2_df, o3_df, pm10_df, so2_df, nox_df](#pollutants) 
    - [merged_covid_dt_LL](#merged_covid_dt_LL)
    - [pm25_5YA_df, pm10_5YA_df, no2_5YA_df, o3_5YA_df, nox_5YA_df](#pollutants5ya)
    
    
- [Aim2](../code/Aim2.ipynb)  
    - [covid_deaths](#covid_deaths) 
    - [pop_dens](#pop_dens) 
    - [earning](#earning) 
    - [age](#age) 
    - [covid_air_dt](#covid_air_dt)
    - [cases_LA_raw ](#cases) 
    - [no2_2014, no2_2015, no2_2016, no2_2017, no2_2018](#no2_5y) 
    - [covid_air_dt_5YA](#covid_air_dt_5YA)
    - [avgEarnings_2014, avgEarnings_2015, avgEarnings_2016, avgEarnings_2017, avgEarnings_2018](#avgEarnings)
    - [Pop_density_5ya](#Pop_density_5ya)
    - [age_5ya](#age_5ya)

In [5]:
%run ../code/conf_files.ipynb

##### preL_dt
<a id='preL_dt'></a>

In [3]:
preL_dt = pd.read_csv("%s/26-4-2020_yyAIR_COVID_PRE_LD_dt.csv" %path)
preL_dt.head()

,Unnamed: 0,Region,cases_preL,deaths_preL,Date_cases,Population_size_2018,Average_Pop_density_personkm2,Cases,Deaths,NO.levels,NO2.levels,O3.levels
0,1,East Of England,5356,746,NaN,6201214,324.0,6499,1448,9.502135,19.553718,54.367479
1,2,London,16913,2120,NaN,8908081,5666.0,19511,3522,25.193133,38.512520,36.913913
2,3,Midlands,10501,1491,NaN,10704906,380.5,14844,2684,14.529437,24.119851,47.698892
3,4,North East And Yorkshire,8004,893,NaN,8137524,333.0,10633,1641,16.501209,25.151394,45.295342
4,5,North West,9394,847,NaN,7292093,517.0,12093,1801,8.581661,20.062745,48.950810

The dataset preL_dt contains: 
- the cumulative numbers of COVID-19 cases ('Cases') and death ('Deaths') count per region un to and including April 8, 2020 
- the cumulative numbers of COVID-19 cases ('cases_preL') and death ('deaths_preL') count per region pre Lockdown
- the population size ('Population_size_2018') and the average population density ('Average_Pop_density_personkm2') per region
- annual mean values of daily measurements (Î¼g/m3) for the three major air pollutatnts recorded between 2018 and 2019, that are nitrogen dioxide (NO2.levels), nitrogen oxode ('NO.levels') and ozone ('O3.levels)

<a id='merged_covid_dt'></a>
##### merged_covid_dt

In [2]:
merged_covid_dt = pd.read_csv("../data_out/merged_covid_dt.csv")
merged_covid_dt.head()

,Unnamed: 0,Code,Mean_ann_earnings,median_age_2018,Name,2018 people per sq. km,deaths
0,1,E06000001,25985.0,41.8,Hartlepool,997,20
1,2,E06000002,22878.0,36.2,Middlesbrough,2608,60
2,3,E06000003,23236.0,45.0,Redcar and Cleveland,558,26
3,4,E06000004,26622.0,40.4,Stockton-on-Tees,962,26
4,0,E06000005,26908.0,43.1,Darlington,540,14

The dataset merged_covid_dt contains:
- the subregion code ('Code') and name ('Name')
- the mean annual earning in 2018 ('Mean_ann_earnings')
- the median age in 2018 ('median_age_2018)
- the population density in 2018 ('2018 people per sq. km')
- the cumulative number of covid19 deaths up to the beginning af April 2020

<a id='pollutants'></a>
##### pm25_df, no2_df, o3_df, pm10_df, so2_df, nox_df

In [6]:
pm25_5YA_df = pd.read_csv("%s/processed_allAP_lonlat.csv" %path_output, usecols=['lon','lat','pm25_5yAvg'])
no2_5YA_df = pd.read_csv('%s/processed_allAP_lonlat.csv' %path_output, usecols = ['lon','lat','no2_5yAvg'])
o3_5YA_df = pd.read_csv('%s/processed_allAP_lonlat.csv' %path_output, usecols = ['lon','lat','o3_5yAvg'])
pm10_5YA_df = pd.read_csv('%s/processed_allAP_lonlat.csv' %path_output, usecols = ['lon','lat','pm10_5yAvg'])
nox_5YA_df = pd.read_csv('%s/processed_allAP_lonlat.csv' %path_output, usecols = ['lon','lat','nox_5yAvg'])
pm25_5YA_df.head()

   pm25_5yAvg       lon        lat
0    4.116575 -0.888372  60.853691
1    4.105491 -0.907079  60.844866
2    4.118182 -0.888684  60.844715
3    4.118773 -0.870288  60.844562
4    4.119644 -0.851893  60.844406

The datasets pollutant_5YA_df contain
- the 2014-2018 average pollutant's value
- the corresponding longitude and latitude

<a id='merged_covid_dt_LL'></a>
##### merged_covid_dt_LL

In [3]:
merged_covid_dt_LL = pd.read_csv('../data_out/merged_covid_dt_LL.csv')
merged_covid_dt_LL.head()

,Unnamed: 0,Code,Mean_ann_earnings,median_age_2018,Name,2018 people per sq. km,deaths,lat,lon
0,1,E06000001,25985.0,41.8,Hartlepool,997,20,54.685728,-1.209370
1,2,E06000002,22878.0,36.2,Middlesbrough,2608,60,54.576042,-1.234405
2,3,E06000003,23236.0,45.0,Redcar and Cleveland,558,26,54.567906,-1.005496
3,4,E06000004,26622.0,40.4,Stockton-on-Tees,962,26,54.564094,-1.312916
4,0,E06000005,26908.0,43.1,Darlington,540,14,54.524208,-1.555581

The dataset merged_covid_dt_LL contains the same information of [merged_covid_dt](#merged_covid_dt) with the additional latitude and longitude

<a id='pollutants5ya'></a>
##### pm25_5YA_df, pm10_5YA_df, no2_5YA_df, o3_5YA_df, nox_5YA_df

In [7]:
pm25_5YA_df = pd.read_csv("%s/processed_allAP_lonlat.csv" %path_output, usecols=['lon','lat','pm25_5yAvg'])
no2_5YA_df = pd.read_csv('%s/processed_allAP_lonlat.csv' %path_output, usecols = ['lon','lat','no2_5yAvg'])
o3_5YA_df = pd.read_csv('%s/processed_allAP_lonlat.csv' %path_output, usecols = ['lon','lat','o3_5yAvg'])
pm10_5YA_df = pd.read_csv('%s/processed_allAP_lonlat.csv' %path_output, usecols = ['lon','lat','pm10_5yAvg'])
nox_5YA_df = pd.read_csv('%s/processed_allAP_lonlat.csv' %path_output, usecols = ['lon','lat','nox_5yAvg'])
pm25_5YA_df.head()

   pm25_5yAvg       lon        lat
0    4.116575 -0.888372  60.853691
1    4.105491 -0.907079  60.844866
2    4.118182 -0.888684  60.844715
3    4.118773 -0.870288  60.844562
4    4.119644 -0.851893  60.844406

The datasets pollutant_5YA_df contain
- the 2014-2018 average pollutant's value
- the correspondig longitude and latitude

<a id='covid_deaths'></a>
##### covid_deaths

In [12]:
covid_deaths = pd.read_csv("%s/covid_deaths_until10April_byAreaCode.csv" %path)
covid_deaths.head()

,Area code,Area name,Home,Hospital,Care home,Hospice,Other communal establishment,Elsewhere
0,E06000001,Hartlepool,1,14,5,0,0,0
1,E06000002,Middlesbrough,1,49,10,0,0,0
2,E06000003,Redcar and Cleveland,1,22,2,0,0,1
3,E06000004,Stockton-on-Tees,3,19,4,0,0,0
4,E06000005,Darlington,0,12,2,0,0,0

The covid_deaths dataset contains:
- the area code
- the area name
- number of covid deaths at home
- number of covid deaths at the hospital
- number of covid deaths at a care home
- number of covid deaths at the hospice
- number of covid deaths in other communal establishment
- number of covid deaths elsewhere

<a id='pop_dens'></a>
##### pop_dens

In [7]:
pop_dens = pd.read_csv("%s/2018_official_popDensity.csv" %path)[['Code', '2018 people per sq. km']]
pop_dens.head()

        Code 2018 people per sq. km
0  E06000047                    237
1  E06000005                    540
2  E06000001                    997
3  E06000002                  2,608
4  E06000057                     64

The dataset pop_dens contains:
- the subregion code
- the 2018 population density per subregion

<a id='earning'></a>
##### earning

In [8]:
earning = pd.read_csv("%s/ann_earning_2018_perLA.csv" %path)[["Code","Mean_ann_earnings"]]
earning.head()

        Code Mean_ann_earnings
0  K02000001            29,817
1  K03000001            29,950
2  K04000001            30,140
3  E92000001            30,397
4  E12000001            25,805

The dataset earning contains:
- the subregion code
- the 2018 mean annual earning

<a id='age'></a>
##### age

In [13]:
age = pd.read_csv("%s/processed_median_age_of_population_perLA.csv" %path)[["Code","median_age_2018","Name"]]
age.head()

        Code  median_age_2018               Name
0  K02000001             40.1     UNITED KINGDOM
1  K03000001             40.2      GREAT BRITAIN
2  K04000001             40.0  ENGLAND AND WALES
3  E92000001             39.9            ENGLAND
4  E12000001             41.8         NORTH EAST

The dataset age contains:
- the subregion code
- the subregion name
- the 2018 median age

<a id='covid_air_dt'></a>
##### covid_air_dt

In [9]:
covid_air_dt = pd.read_csv("../data_out/covid_air_dt.csv", na_values='x')
covid_air_dt.head()

,lon,lat,Code,deaths,X2018_people_per_sq_km,Mean_ann_earnings,median_age_2018,pm25_val,no2_val,o3_val,pm10_val,so2_val,nox_val
0,-1.209370,54.685728,E06000001,20,997,25985.0,41.8,7.362821,13.105737,5.303858,11.506778,1.575561,17.730895
1,-1.234405,54.576042,E06000002,60,2608,22878.0,36.2,8.210540,20.178191,4.251802,12.561928,3.133286,29.296034
2,-1.005496,54.567906,E06000003,26,558,23236.0,45.0,7.293137,7.749542,6.851500,12.855827,0.998864,9.983241
3,-1.312916,54.564094,E06000004,26,962,26622.0,40.4,7.900856,15.562038,5.050632,12.251130,1.934329,21.440737
4,-1.555581,54.524208,E06000005,14,540,26908.0,43.1,7.153221,11.360341,5.198811,11.129635,1.129034,15.098272

The dataset covid_air_dt contains:
- the subregion code
- the cumulative number of deaths up to the beginning of April 2020
- the population density in 2018
- the mean annual earning in 2018
- the median age in 2018
- the mean value of the 10 nearest pollutants (pm25, pm20, no2, nox, o3, so2) value based on the coordinates
- the coordinates

<a id='cases'></a>
##### cases_LA_raw

In [10]:
cases_LA_raw = pd.read_csv("%s/coronavirus-cases_latest-18_5_2020.csv" %path)
cases_LA_raw.head()

,Area name,Area code,Area type,Specimen date,Daily lab-confirmed cases,Previously reported daily cases,Change in daily cases,Cumulative lab-confirmed cases,Previously reported cumulative cases,Change in cumulative cases,Cumulative lab-confirmed cases rate
0,England,E92000001,Nation,2020-05-16,37.0,0.0,37.0,143311,142523.0,788.0,256.0
1,South West,E12000009,Region,2020-05-16,3.0,NaN,NaN,7294,NaN,NaN,130.3
2,South East,E12000008,Region,2020-05-16,1.0,NaN,NaN,20225,NaN,NaN,221.4
3,London,E12000007,Region,2020-05-16,1.0,NaN,NaN,26440,NaN,NaN,296.8
4,East of England,E12000006,Region,2020-05-16,1.0,NaN,NaN,13032,NaN,NaN,210.2

This dataset contain:
- the area code, name and type
- the speciment date
- cumulative lab-cofirmed cases
- other informations about cases (daily cases, rate, ecc...)

<a id='no2_5y'></a>
##### no2_2014, no2_2015, no2_2016, no2_2017, no2_2018

Only the content of the no2_2014 dataset is shown here. Anyway, the structure is common to all the other datsets as well as for the other pollutants

In [9]:
no2_2014 = pd.read_csv("%s/raw_mapno22014.csv" %path, skiprows = 5, na_values="MISSING")
no2_2014.head()

   ukgridcode       x        y  no22014
0       54291  460500  1221500      NaN
1       54292  461500  1221500      NaN
2       54294  463500  1221500      NaN
3       54979  458500  1220500      NaN
4       54980  459500  1220500      NaN

The dataset contains
- the subregion code
- the value for no2 (or onther pollutant) in 2014 (or in another year up to 2018)
- value of easting and northing (kind of coordinate) for each subregion

<a id='covid_air_dt_5YA'></a>
##### covid_air_dt_5YA

In [11]:
covid_air_dt_5YA = pd.read_csv("../data_out/covid_air_dt_5YA.csv" )
covid_air_dt_5YA.head()

,Code,deaths,2018 people per sq. km,Mean_ann_earnings,median_age_2018,pm25_5yAvg,no2_5yAvg,o3_5yAvg,pm10_5yAvg,nox_5yAvg
0,E06000001,20,997,25985.0,41.8,7.617911,14.359226,2.811139,11.625293,20.206839
1,E06000002,60,2608,22878.0,36.2,8.342286,20.537654,2.240947,12.522083,30.628743
2,E06000003,26,558,23236.0,45.0,7.748073,8.440613,3.795747,12.845976,11.273612
3,E06000004,26,962,26622.0,40.4,8.038180,16.408541,2.670293,12.169144,23.435383
4,E06000005,14,540,26908.0,43.1,7.368713,12.552451,2.763806,11.199639,17.361185

The dataset covid_air_dt_5YA contains:
- the subregion code
- the cumulative number of deaths up to the beginning of April 2020
- the mean annual earnings in 2018
- the median age in 2018
- the popultaion density in 2018
- the 2014-2018 average pollution (pm25, pm10, nox, no2, o3) value based on the 10 nearest neighbors

<a id='avgEarnings'></a>
##### avgEarnings_2014, avgEarnings_2015, avgEarnings_2016, avgEarnings_2017, avgEarnings_2018

In [10]:
avgEarnings_2014 = pd.read_csv("%s/avgEarnings_2014.csv" %path_output, na_values = "x", usecols = ["Code","avgEarn_2014"])
avgEarnings_2015 = pd.read_csv("%s/avgEarnings_2015.csv" %path_output, na_values = "x", usecols = ["Code","avgEarn_2015"])
avgEarnings_2016 = pd.read_csv("%s/avgEarnings_2016.csv" %path_output, na_values = "x", usecols = ["Code","avgEarn_2016"])
avgEarnings_2017 = pd.read_csv("%s/avgEarnings_2017.csv" %path_output, na_values = "x", usecols = ["Code","avgEarn_2017"])
avgEarnings_2018 = pd.read_csv("%s/avgEarnings_2018.csv" %path_output, na_values = "x", usecols = ["Code","avgEarn_2018"])
avgEarnings_2018.head()

        Code avgEarn_2018
0  K02000001       29,817
1  K03000001       29,950
2  K04000001       30,140
3  E92000001       30,397
4  E12000001       25,805

All these datasets have the same structure and variables. They contain:

- the subregion Code
- the average earning for a given year between 2014 and 2018

<a id='Pop_density_5ya'></a>
##### Pop_denisty_5ya

In [11]:
Pop_density_5ya = pd.read_csv("%s/Pop_density_full_dt.csv" %path, usecols = ["Code","pop_dens_5ya"])
Pop_density_5ya.head()

        Code pop_dens_5ya
0  K02000001          271
1  K03000001          279
2  K04000001          387
3  E92000001          425
4  E12000001          308

The dataset Pop_desnity_5ya contains:
- the subregion code
- the mean of the yearly mean population density over the years 2014-2018

<a id='age_5ya'></a>
##### age_5ya

In [12]:
age_5ya = pd.read_csv("%s/age_5ya.csv" %path_output, usecols = ["Code","age_5ya"])
age_5ya.head()

        Code  age_5ya
0  K02000001     40.0
1  K03000001     40.1
2  K04000001     39.9
3  E92000001     39.8
4  E12000001     41.9

The dataset age_5ya contains:
- the subregion code
- the mean value of the yearly median age over the years 2014-2018